/*
 * cube.js
 *
 *  Created on: 2014-8-13
 *    Author: Wang Yang
 *      blog: http://blog.wysaid.org
 */

//好吧，这个模型是我(wy)手动创建的。 木有版权，哈哈哈

WGE.CubeModel = {};
WGE.CubeModel.mesh = new Float32Array(
[1, 1, 1,  -1, 1, 1,  -1,-1, 1,  1,-1, 1, 
1, 1, 1,  1,-1, 1,  1,-1,-1,  1, 1,-1,
1, 1, 1,  1, 1,-1,  -1, 1,-1,  -1, 1, 1,
-1, 1, 1,  -1, 1,-1,  -1,-1,-1,  -1,-1, 1,
-1,-1,-1,  1,-1,-1,  1,-1, 1,  -1,-1, 1,
1,-1,-1,  -1,-1,-1,  -1, 1,-1,  1, 1,-1]);

WGE.CubeModel.meshDataSize = 3; //每个点包含三个分量。

WGE.CubeModel.meshIndex = new Uint16Array(
[0, 1, 2,  0, 2, 3,
4, 5, 6,  4, 6, 7,
8, 9,10,  8,10,11,
12,13,14,  12,14,15,
16,17,18,  16,18,19,
20,21,22,  20,22,23]);

WGE.CubeModel.texMesh = new Float32Array(
[1, 1,  0, 1,  0, 0,  1, 0,
0, 1,  0, 0,  1, 0,  1, 1,
1, 0,  1, 1,  0, 1,  0, 0,
1, 1,  0, 1,  0, 0,  1, 0,
0, 0,  1, 0,  1, 1,  0, 1,
0, 0,  1, 0,  1, 1,  0, 1]);

WGE.CubeModel.texMeshDataSize = 2;

WGE.CubeModel.normals = new Float32Array(
[0, 0, 1,  0, 0, 1,  0, 0, 1,  0, 0, 1,
1, 0, 0,  1, 0, 0,  1, 0, 0,  1, 0, 0,
0, 1, 0,  0, 1, 0,  0, 1, 0,  0, 1, 0,
-1, 0, 0,  -1, 0, 0,  -1, 0, 0,  -1, 0, 0,
0,-1, 0,  0,-1, 0,  0,-1, 0,  0,-1, 0,
0, 0,-1,  0, 0,-1,  0, 0,-1,  0, 0,-1]);

WGE.CubeModel.normalsDataSize = 3;